#+TITLE:SQLite and how to use it in Python
#+DATE: <2020-04-19 Sun>
#+SETUPFILE: https://akhsim.github.io/read-akhsiM-orgs/theme-readtheorg-akhsiM.setup

** Starting & Setup
Let's say that we want to create an application where we have Employees. We also want to have add/ update and delete Employees from the database, as well as being able to query Employees from that database.

We need to:
1. import sqlite3
2. create a database connection object
   - within the ~sqlite3.connect()~ method arguments, we can either pass in a file where our data is stored. We can even do an *in-memory* database like this: ~conn = sqlite3.connect(':memory:')~.

#+BEGIN_SRC python :exports both :results output :session
import sqlite3

conn = sqlite3.connect('employee.db')

#+END_SRC

This creates a file in the current dir (note the file size 0 B right now):

#+begin_src bash
ls -la | grep *.db
#+end_src

#+RESULTS:
: -rw-r--r--  1 kkennynguyen kkennynguyen       0 Apr 20 00:16 employee.db

(If the file exists, sqlite3 will just connect to that database file.)
..then we have to create a cursor to execute SQL commands.

with a cursor, we can run commands using ~execute()~ method.

After running a command, we have to commit the connection. This commit the current transactions.

Afterward, it's good practice to close the connection.

#+BEGIN_SRC python :exports both :results output :session
import sqlite3

conn = sqlite3.connect('employee.db')

c = conn.cursor()

#create a table Employees with Firstname, Lastname and Pay.
c.execute(""" 
	CREATE TABLE employees (
		first text,
		last text,
		pay integer
			)""")

conn.commit()
conn.close()
#+END_SRC

#+RESULTS:

After running the above script, a table has been created in the *employee.db* file. We the file again and see the size of the file has changed to 8192 B or 8 KB.

#+begin_src bash
ls -la | grep *.db
#+end_src

#+RESULTS:
: -rw-r--r--  1 kkennynguyen kkennynguyen    8192 Apr 20 00:25 employee.db

If I run the same script again, we would get an error because the table has already existed. This is good.

#+BEGIN_SRC python :exports both :results output :session
import sqlite3

conn = sqlite3.connect('employee.db')

c = conn.cursor()

#create a table Employees with Firstname, Lastname and Pay.
c.execute(""" 
	CREATE TABLE employees (
		first text,
		last text,
		pay integer
			)""")

conn.commit()
conn.close()
#+END_SRC

#+RESULTS:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
:   File "/tmp/babel-fwY7Nq/python-b2Eked", line 8, in <module>
:     c.execute(""" 
: sqlite3.OperationalError: table employees already exists

** Querying the database

#+BEGIN_SRC python :exports both :results output :session
import sqlite3

conn = sqlite3.connect('employee.db')

c = conn.cursor()

c.execute('SELECT * FROM employees')

print(c.fetchall())

# Instead of fetchall we can also fetchone or fetchmany

conn.commit()
conn.close()
#+END_SRC

#+RESULTS:
: [('Kenny', 'Nguyen', 50000)]

What we did above is we retrieve data by running direct SQL commands. However in a real applications we want to have some Python variables and we want to put the values of these variables into the query.

** Working with a class

Create an entry using an instance of a class.

We can choose to use a formatted Python string for this, which is similar to something like ~c.execute("INSERT INTO employees VALUES ('{}', '{}', {})".format(emp1.first, emp1.last, emp1.pay))~. However this makes our program vulnerable to *SQL injection attack*.

The reason for that is doing SQL insert this way does not involve a proper escape.

There are two different ways:
1. Using the question marks as placeholders
2. Using a dictionary

#+BEGIN_SRC python :exports both :results output :session
import sqlite3

class Employee:

	def __init__(self, first, last, pay):
		self.first = first
		self.last = last
		self.pay = pay

	@property
	def email(self):
		return '{}.{}@email.com'.format(self.first, self.last)

	@property
	def fullname(self):
		return '{} {}'.format(self.first, self.last)

	def __repr__(self):
		return "Employee ('{}', '{}', {})".format(self.first, self.last, self.pay)

conn = sqlite3.connect('employee.db')

c = conn.cursor()

emp1 = Employee('John', 'Smith', 80000)
emp2 = Employee('Jane', 'Lee', 80000)

# first way - question mark placeholder and a tuple
c.execute("INSERT INTO employees VALUES (?, ?, ?)", (emp1.first, emp1.last, emp1.pay))
conn.commit()

# second way - using a dictionary
c.execute('INSERT INTO employees VALUES (:first, :last, :pay)', {'first': emp2.first, 'last': emp2.last, 'pay': emp2.pay})
conn.commit()

conn.close()
#+END_SRC

#+RESULTS:
*Note*: Even if we are putting in one value, that has to be wrapped in a tuple (first way).

Now we can re-query it and there should be two new employee rows.
#+BEGIN_SRC python :exports both :results output :session
import sqlite3

conn = sqlite3.connect('employee.db')

c = conn.cursor()

c.execute('SELECT * FROM employees')

print(c.fetchall())

# Instead of fetchall we can also fetchone or fetchmany

conn.close()
#+END_SRC

#+RESULTS:
: [('Kenny', 'Nguyen', 50000), ('Jane', 'Lee', 80000), ('John', 'Smith', 80000)]

We can also use the two approaches in a SELECT statement, i.e avoiding direct SQL:
#+BEGIN_SRC python :exports both :results output :session
import sqlite3

conn = sqlite3.connect('employee.db')

c = conn.cursor()

# first way - question mark placeholder and a tuple
c1 = c.execute('SELECT * FROM employees WHERE last=?', ('Smith',))

print(c1.fetchall())

# second way - using a dictionary
c2 = c.execute('SELECT * FROM employees WHERE last=:last', {'last': 'Nguyen'})

print(c2.fetchall())

# Instead of fetchall we can also fetchone or fetchmany

conn.close()
#+END_SRC

#+RESULTS:
: [('John', 'Smith', 80000)]
: [('Kenny', 'Nguyen', 50000)]

*** Intro

#+BEGIN_SRC python :exports both :results output :session
import sqlite3

class Employee:

	def __init__(self, first, last, pay):
		self.first = first
		self.last = last
		self.pay = pay

	@property
	def email(self):
		return '{}.{}@email.com'.format(self.first, self.last)

	@property
	def fullname(self):
		return '{} {}'.format(self.first, self.last)

	def __repr__(self):
		return "Employee ('{}', '{}', {})".format(self.first, self.last, self.pay)

conn = sqlite3.connect(':memory:')
c = conn.cursor()

c.execute(""" 
	CREATE TABLE employees (
		first text,
		last text,
		pay integer
			)""")

emp1 = Employee('John', 'Smith', 80000)
emp2 = Employee('Jane', 'Lee', 80000)

# raw sql
c.execute('INSERT INTO employees VALUES ("Kenny", "Nguyen", 50000)')

# first way - question mark placeholder and a tuple
c.execute("INSERT INTO employees VALUES (?, ?, ?)", (emp1.first, emp1.last, emp1.pay))


# second way - using a dictionary
c.execute('INSERT INTO employees VALUES (:first, :last, :pay)', {'first': emp2.first, 'last': emp2.last, 'pay': emp2.pay})

conn.commit()

c.execute('SELECT * FROM employees')
print(c.fetchall())

conn.close()
#+END_SRC

#+RESULTS:
: [('Kenny', 'Nguyen', 50000), ('John', 'Smith', 80000), ('Jane', 'Lee', 80000)]

*** Using in-mem database to prototype a basic Python application

Tips: To make our application more Pythonic, when handling database connection in Python, use *context manger*, instead of manually commiting each statement. This is applicable to write statements, read statements aren't needed to be commited.

This ensures that if the transactions isn't executed properly, it would be rolled back.

#+BEGIN_SRC python :exports both :results output :session
import sqlite3

class Employee:

	def __init__(self, first, last, pay):
		self.first = first
		self.last = last
		self.pay = pay

	@property
	def email(self):
		return '{}.{}@email.com'.format(self.first, self.last)

	@property
	def fullname(self):
		return '{} {}'.format(self.first, self.last)

	def __repr__(self):
		return "Employee ('{}', '{}', {})".format(self.first, self.last, self.pay)

conn = sqlite3.connect(':memory:')
c = conn.cursor()

c.execute(""" 
	CREATE TABLE employees (
		first text,
		last text,
		pay integer
			)""")

def insert_emp(emp):
	with conn:
		c.execute("INSERT INTO employees VALUES (:first, :last, :pay)", {'first': emp.first, 'last': emp.last, 'pay': emp.pay})

def get_emps_by_name(lastname):
	c.execute("SELECT * FROM employees WHERE last=:last", {'last': lastname})
	return c.fetchall()

def update_pay(emp, pay):
	with conn:
		c.execute("""
			UPDATE employees SET pay = :pay
			WHERE first = :first AND last = :last	
	""", {'first': emp.first, 'last': emp.last, 'pay': pay})		
	
def remove_emp(emp):
	with conn:
		c.execute("""
		DELETE FROM employees
		WHERE first = :first and last = :last 
	""", {'first': emp.first, 'last': emp.last})


emp1 = Employee('Kenny', 'Nguyen', 50000)
print('emp1:', emp1)
emp2 = Employee('John', 'Smith', 60000)
print('emp2:', emp2)

# Run 1
print('Run 1.. insert and select emp1')
insert_emp(emp1)
print(get_emps_by_name('Nguyen'))

# Run 2
print('Run 2.. insert and select emp2')
insert_emp(emp2)
print(get_emps_by_name('Smith'))

# Run 3
print('Run 3.. remove and select emp2')
remove_emp(emp2)
print(get_emps_by_name('Smith'))

# Run 4
print('Run 4.. change pay for emp1')
print('before:', get_emps_by_name('Nguyen'))
update_pay(emp1, 100000)
print('after:', get_emps_by_name('Nguyen'))


#+END_SRC

#+RESULTS:
#+begin_example
emp1: Employee ('Kenny', 'Nguyen', 50000)
emp2: Employee ('John', 'Smith', 60000)
Run 1.. insert and select emp1
[('Kenny', 'Nguyen', 50000)]
Run 2.. insert and select emp2
[('John', 'Smith', 60000)]
Run 3.. remove and select emp2
[]
Run 4.. change pay for emp1
before: [('Kenny', 'Nguyen', 50000)]
after: [('Kenny', 'Nguyen', 100000)]
#+end_example
